app/controllers/proposal_viewer_controller.rb

SELECT * FROM "proposals" WHERE ("proposals".client_id = 1) LIMIT 1
---
  def show
    proposal = Proposal.find(params[:id])